MPS/src/Catalogs/ТочкиСценарияУсловие/ТочкиСценарияУсловие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиСценарияУсловие</name>
  <owners>Catalog.Сценарии</owners>
  <attributes>
    <name>ВидТочкиУсловия</name>
    <type>
      <types>EnumRef.ВидыТочкиУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментПродуктов</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктовВСегментеОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктовВСегментеДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборПромокодов</name>
    <type>
      <types>CatalogRef.НаборыПромокодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

MPS/src/Enums/ВидыТочкиУсловия/ВидыТочкиУсловия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТочкиУсловия</name>
  <enumValues>
    <name>ПоКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ПоДоступностиПромокода</name>
  </enumValues>
  <enumValues>
    <name>ПоНаличиюПродуктов</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Catalogs/ТочкиСценарияУсловие/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если ВидТочкиУсловия = Перечисления.ВидыТочкиУсловия.ПоКлиенту Тогда
		Настройки = ХранилищеНастроекКомпоновкиДанных.Получить();
		Если не ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПериодовДействия" , "Не заполнено время ожидания");
		КонецЕсли;	
	ИначеЕсли ВидТочкиУсловия = Перечисления.ВидыТочкиУсловия.ПоНаличиюПродуктов Тогда
		Если не ЗначениеЗаполнено(СегментПродуктов) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.СегментПродуктов" , "Не заполнен сегмент продуктов");
		КонецЕсли;	
		Если КоличествоПродуктовВСегментеОт = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПродуктовВСегментеОт" , "Не заполнена нижняя граница количества в сегменте");
		КонецЕсли;	
		Если КоличествоПродуктовВСегментеДо = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПродуктовВСегментеДо" , "Не заполнена верхняя граница количества в сегменте");
		КонецЕсли;	
		Если КоличествоПродуктовВСегментеДо<КоличествоПродуктовВСегментеОт Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПродуктовВСегментеДо" , "Некорректный интервал количества");
		КонецЕсли;	
	ИначеЕсли ВидТочкиУсловия = Перечисления.ВидыТочкиУсловия.ПоДоступностиПромокода Тогда
			Если не ЗначениеЗаполнено(НаборПромокодов) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.НаборПромокодов" , "Не заполнен набор промокодов");
			КонецЕсли;	
	КонецЕсли;	

	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);

КонецПроцедуры
